package com.loan.enums;

/**
 * @description:
 * @author:
 * @time: 2019/11/24 20:43
 */
public enum CodeEnum {
    /**
     * 系统异常
     */
    SYSTEM_ERROR(-1, "系统繁忙，请稍后再试!"),
    /**
     * 请求参数有误
     */
    PARAMS_ILLEGAL(400, "请求参数有误！"),
    /**
     * 无权限
     */
    FORBIDDEN(403, "无权限操作！"),
    /**
     * 资源不存在
     */
    SOURCE_NOT_EXIST(404, "资源不存在！"),
    /**
     * 操作失败
     */
    OPTION_FAIL(500, "操作失败！"),
    //===================100段start====================================
    /**
     * 登录失败
     */
    LOGIN_FAIL(10001, "密码错误！"),
    /**
     * 用户未登录
     */
    NO_LOGIN(10002, "请先登录！"),
    /**
     * 密码输入不一致
     */
    PASSWORD_DIFFER(10003, "密码输入不一致！"),
    /**
     * 密码格式不正确
     */
    PASSWORD_FORMAT_ERROR(10004, "密码格式不正确！"),
    /**
     * 账号已被停用
     */
    ACCOUNT_FORBIDDEN(10005, "账号已被停用，请联系管理员！"),
    /**
     * 密码不正确
     */
    PASSWORD_NOT_CORRECT(10006, "密码不正确！"),
    /**
     * 用户名已存在
     */
    USER_NAME_HAS_EXIST(10007, "用户名已存在！"),
    /**
     * 错误的手机号
     */
    INCORRECT_MOBILE(10008, "错误的手机号！"),
    /**
     * 账号不存在
     */
    ACCOUNT_NOT_EXIST(10009, "账号不存在！"),
    //===================100段end====================================

    //===================200段start====================================
    /**
     * 上传文件为空
     */
    EMPTY_FILE(20001, "上传文件不能为空！"),
    /**
     * 文件上传失败
     */
    UPLOAD_FILE_FAIL(20002, "文件上传失败！"),
    /**
     * 文件格式有误
     */
    FILE_FORMAT_ERROR(20003, "文件格式有误！"),
    //===================200段end====================================

    //===================300段start====================================
    /**
     * 站点不存在
     */
    SITE_NOT_EXIST(30001, "访问站点不存在！"),
    /**
     * 站点已关闭
     */
    SITE_HAS_CLOSED(30002, "访问站点已关闭！"),
    /**
     * 站点域名已存在
     */
    SITE_HAS_EXISTED(30004, "该站点域名已存在！"),
    /**
     * 没有配置站点信息
     */
    SITE_NOT_INITIAL(30005, "请先设置站点域名！"),
    //===================300段end====================================

    //===================400段start====================================

    /**
     * 图片验证码已过期
     */
    IMAGE_CODE_TIME_OUT(40001, "图片验证码已过期！"),

    /**
     * 图片验证码不正确
     */
    IMAGE_CODE_ERROR(40002, "图片验证码不正确！"),

    /**
     * 短信验证码不正确
     */
    SMS_CODE_ERROR(40003, "短信验证码不正确！"),
    /**
     * 短信业务已被禁止
     */
    SMS_SERVICE_FORBIDDEN(40004, "短信业务已被禁止，请联系在线客服！"),
    /**
     * 短信验证码已过期
     */
    SMS_CODE_TIME_OUT(40001, "短信验证码已过期！"),
    //===================400段end====================================

    //===================500段start====================================

    /**
     * 手机号已注册
     */
    PHONE_NUMBER_HAS_LOG_UP(50001, "手机号已注册！"),

    /**
     * 手机号未注册
     */
    PHONE_NUMBER_NOT_LOG_UP(50001, "手机号未注册！"),
    //===================500段end====================================

    //===================600段start====================================
    NOT_ENOUGH_AMOUNT(60001, "提现额度不足！"),

    /**
     * 用户存在借款单，禁止删除
     */
    FORBIDDEN_DELETE_USER(60002, "该用户已有借款单，如需继续删除，请先删除借款单再操作！"),

    /**
     * 用户存在冻结金额
     */
    HAS_FREEZE_AMOUNT(60003, "当前存在冻结金额，无法操作！"),

    /**
     * 有未处理的提现记录
     */
    HAS_UN_PROCESS_WITHDRAW_RECORD(60004, "当前有未处理的提现记录，无法操作！"),

    /**
     * 当前无提现申请
     */
    NOT_EXIST_WITHDRAW_RECORD(60005, "当前无体现申请，无需此操作！"),
    //===================600段end====================================
    ;

    private Integer code;

    private String msg;

    CodeEnum(Integer code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public Integer getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

}
